RED='\e[31m'
ORANGE='\e[93m'
echo -e "${RED} "
echo ""
echo "  ██╗░░██╗░█████╗░░█████╗░██╗░░██╗██╗███╗░░██╗░██████╗░  ████████╗░█████╗░░█████╗░██╗░░░░░██╗░░██╗██╗████████╗   ";
echo "  ██║░░██║██╔══██╗██╔══██╗██║░██╔╝██║████╗░██║██╔════╝░  ╚══██╔══╝██╔══██╗██╔══██╗██║░░░░░██║░██╔╝██║╚══██╔══╝   ";
echo "  ███████║███████║██║░░╚═╝█████═╝░██║██╔██╗██║██║░░██╗░  ░░░██║░░░██║░░██║██║░░██║██║░░░░░█████═╝░██║░░░██║░░░   ";
echo "  ██╔══██║██╔══██║██║░░██╗██╔═██╗░██║██║╚████║██║░░╚██╗  ░░░██║░░░██║░░██║██║░░██║██║░░░░░██╔═██╗░██║░░░██║░░░   ";
echo "  ██║░░██║██║░░██║╚█████╔╝██║░╚██╗██║██║░╚███║╚██████╔╝  ░░░██║░░░╚█████╔╝╚█████╔╝███████╗██║░╚██╗██║░░░██║░░░   ";
echo "  ╚═╝░░╚═╝╚═╝░░╚═╝░╚════╝░╚═╝░░╚═╝╚═╝╚═╝░░╚══╝░╚═════╝░  ░░░╚═╝░░░░╚════╝░░╚════╝░╚══════╝╚═╝░░╚═╝╚═╝░░░╚═╝░░░   ";

echo -e "${ORANGE}  [X]  𝗔𝗟𝗟 𝗜𝗡 𝗢𝗡𝗘 𝗛𝗮𝗰𝗸𝗶𝗻𝗴 𝗧𝗼𝗼𝗹 𝗙𝗼𝗿 𝗛𝗮𝗰𝗸𝗲𝗿𝘀 𝗧𝗼𝗼𝗹 𝗖𝗿𝗲𝗮𝘁𝗲𝗱 𝗯𝘆 𝘾𝙤𝙙𝙞𝙣𝙜 𝙍𝙖𝙣𝙟𝙞𝙩𝙝 𝙁𝙧𝙤𝙢 𝙄𝙉𝘿𝙄𝘼 [X]";

clear

sudo chmod +x /etc/

clear

sudo chmod +x /usr/share/doc

clear

sudo rm -rf /usr/share/doc/hackingtoolkit/

clear

cd /etc/

clear

sudo rm -rf /etc/hackingtoolkit

clear

mkdir hackingtoolkit

clear

cd hackingtoolkit

clear

git clone https://github.com/CodingRanjith/hackingtoolkit.git

clear

cd hackingtoolkit

clear

sudo chmod +x install.sh

clear

./install.sh

clear
